/*
Создайте две HTML страницы с разным контентом. 
Создайте страницу, в которой находиться сценарий 
загружающий и отображающий контент двух страниц 
при нажатии на кнопку. Контент должен загружаться 
асинхронно. 
*/
/*
Задание 1 
Разработайте страницу с двумя полями ввода и 
кнопкой. Пользователь должен вводить в поля 
вводов целочисленный значения, а нажатие по 
кнопке должно приводить к асинхронному запросу 
на сервер. Запрашивать следует обработчик 
CalcHandler.ashx, который находиться вместе 
с примерами в уроке номер 10, обработчик 
принимает два post параметра с именами 
‘a’ и ‘b' Результат который возвращает 
обработчик выведите на страницу. 
*/