/*Разработайте страницу регистрации нового пользователя. 
Форма должна получать от пользователя следующие данные: 
имя, фамилия, логин, пароль, подтверждение пароля, 
email, пол (мужчина/женщина). 
Форма должна проверять: 
1) Все поля вводов должны быть заполнены. 
2) Пароль и подтверждение пароля должны совпадать.  
3) Email должен быть указан в правильном формате. 
При не удовлетворении этих правил форма должна выводить 
сообщение об ошибке (не через alert). 
*/


/*
Задание 1 
Разработайте страницу заказа пиццы.  
Требования к странице:  
Можно заказать три вида пиццы - маленькая, большая, средняя. 
Можно самостоятельно выбрать ингредиенты к пицце - грибы, бекон, помидоры, сыр, оливки. 
На странице должна вводиться информация о покупателе (его телефон и адрес доставки). 
 
Подумайте, какие данные следует проверять на странице, реализуйте эту проверку. 
Также реализуйте подсчет стоимости пиццы, при выборе размеров и ингредиентов, автоматические должна пересчитываться сумма заказа. Цены на размер пиццы и отдельные ингредиенты выберите произвольно. 
/////////////////////////////////////////////////////////////
*/


/*
Задание 2 
Реализуйте модуль для работы атрибута watermark, который будет отображать подсказку для поля ввода в который еще не вводилось значение. Поля вводов с применением модуля должны выглядеть так <input type=”text” name=”login” watermark=”Введите свой логин” /> 
При загрузке страницы с такой формой в поле ввода должно отображаться сообщение «Введите свой логин», при клике на поле ввода это сообщение должно исчезат. 
 */