/*Создайте страницу с произвольным количеством изображений. 
Создайте сценарий, который выведет адреса всех изображений 
которые загруженные на страницу, после чего с интервалом в 
одну секунду по очереди, каждому изображению добавит красную 
рамку. 
*/
/*
Задание 1 
Создайте страницу с тремя кнопками, при нажатии на каждую из 
кнопок должно меняться изображение выводимое на странице. 
*/
/*
Задание 2 
Создайте страницу-галерею. На странице должен выводиться список 
картинок preview небольших размеров. При нажатии на каждое 
изображение превью должно отображаться большое изображение.  
*/
/*
Задание 3 
Используя элемент canvas, напишите модуль, с помощью которого 
на странице будет отображаться диаграмма в соответствии с 
данными переданными массивом в модуль. 
*/