/*
Создайте страницу, которая будет отображать 
дату последнего посещения пользователя. 
После закрытия страницы информация должна 
сохранятся в cookie на протяжении одного месяца. 
*/
window.onload=function(){
    let p80=this.document.getElementsByName("task80")[0];
    p80.innerHTML="";
}
/*
Создайте страницу, которую пользователь сможет 
персонализировать. На странице должен находиться 
выпадающий список с названиями цветов и поле ввода, 
в которое можно будет ввести только целочисленное 
значение. При нажатии на кнопку сохранить, цвет 
выбранный в выпадающем списке должен быть присвоен 
фону странице, а целочисленное значение из поля ввода, 
должно использоваться для изменения размера шрифта на 
странице. Выбранные настройки должны сохраниться в 
cookie набор и при повторном заходе пользователя на 
страницу, настройки должны восстановиться. 
*/

/*
Задание 2 
Создайте вторую версию сайта описанную в первом 
задании используя localStorage. 

*/