/*Задание для урока 
Создайте функцию-конструктор Box(коробка) для создания объекта со свойствами Height(высота), Width(ширина), Depth(глубина) и Material(материал). Также в объекте должны быть методы Volume - для получения объема и equals() – для сравнения объектов, объекты должны считаться равными если содержат одинаковые значения в свойстве Material. 
 */







 
 /*
Задание 1 
Создайте функцию конструктор, которая создает объект со свойством экземпляра, свойством функции-конструктора, с методом экземпляра и методом функции-конструктора имена выберите произвольно. 
 */
/*
Задание 2 
Разработайте функцию-конструктор, которая будет создавать объект Human(человек) создайте массив объектов и реализуйте функцию, которая будет сортировать элементы массива по значению свойства Age по возрастанию или по убыванию. 
 */
/*
Задание 3 
Разработайте функцию-конструктор, которая будет создавать объект Human(человек) добавьте на свое усмотрение свойства и методы в этот объект. Подумайте какие методы и свойства следует сделать уровня экземпляра, а какие уровня функции-конструктора. 
 */
/*
Задание 4 
Создайте пример демонстрирующий назначение метода toString() 
*/